In [1]:
import numpy as np
from datascience import *

# Group

In [2]:
sky = Table.read_table('skyscrapers_v2.csv')
sky = (sky.with_column('age', 2025 - sky.column('completed'))
          .drop('completed'))
sky.show(3)

#### 1. How many towers are in each city?

In [3]:
sky.where("city", "New York City").num_rows

531

In [4]:
sky.where("city", "Chicago").num_rows

358

In [5]:
sky.where("city", "Philadelphia").num_rows

31

In [6]:
sky.where("city", "Philadelphia")

name                               | material        | city         | height | age
Comcast Center                     | mixed/composite | Philadelphia | 296.73 | 17
One Liberty Place                  | steel           | Philadelphia | 288.04 | 38
Two Liberty Place                  | steel           | Philadelphia | 258.47 | 35
Mellon Bank Center                 | mixed/composite | Philadelphia | 241.41 | 35
Three Logan                        | steel           | Philadelphia | 225.25 | 34
The Residences at the Ritz-Carlton | concrete        | Philadelphia | 157.89 | 16
1818 Market Street                 | steel           | Philadelphia | 152.4  | 51
The St. James                      | concrete        | Philadelphia | 151.84 | 21
Loews Philadelphia Hotel           | steel           | Philadelphia | 149.96 | 93
The Murano                         | concrete        | Philadelphia | 144.78 | 17
... (21 rows omitted)

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
# skip

In [8]:
type(sky.group('city'))

datascience.tables.Table

Tells us how many cities have skyscrapers

In [10]:
sky.group('city').num_rows

35

In [11]:
sky.group('city')

city       | count
Atlanta    | 38
Austin     | 17
Baltimore  | 14
Boston     | 32
Charlotte  | 12
Chicago    | 358
Cincinnati | 13
Cleveland  | 16
Columbus   | 13
Dallas     | 20
... (25 rows omitted)

How can we find the city with the most amount of skyscrapers

In [16]:
sky.group('city').sort('count',descending=True).column('city').item(0)

'New York City'

How can we visualize the number of skyscrapers in each city?

Q: what visualization should we use? answer is the type of ofigure we use for a categorical distribution?

In [22]:
sky.group('city') # for homework, plot this as a bar plot

city       | count
Atlanta    | 38
Austin     | 17
Baltimore  | 14
Boston     | 32
Charlotte  | 12
Chicago    | 358
Cincinnati | 13
Cleveland  | 16
Columbus   | 13
Dallas     | 20
... (25 rows omitted)

#### 2. For each city, what’s the tallest building?

In [ ]:
#skip

In [ ]:
#skip

In [23]:
#skip
sky.group('city', max)

city       | name max                                | material max | height max | age max
Atlanta    | Westin Peachtree Plaza                  | steel        | 311.8      | 128
Austin     | Windsor on the Lake                     | steel        | 208.15     | 88
Baltimore  | The John and Frances Angelos Law Center | steel        | 161.24     | 114
Boston     | Two International Place                 | steel        | 240.79     | 110
Charlotte  | TradeMark                               | steel        | 265.48     | 101
Chicago    | theWit Hotel                            | steel        | 442.14     | 137
Cincinnati | Scripps Center                          | steel        | 202.69     | 112
Cleveland  | Tower at Erieview                       | steel        | 288.65     | 101
Columbus   | William Green Building                  | steel        | 169.3      | 98
Dallas     | W Dallas Victory Hotel & Residences     | steel        | 280.72     | 97
... (25 rows omitted)

In [24]:
sky.where("name", "Westin Peachtree Plaza").select('height')

height
220.37

#### 3. For each city, what’s the tallest building for each material?
(back to slides after asking this question)

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
#skip

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
sky.group(['city', 'material'], max)

## Lists detour

In [26]:
[100., 200, "50"]

[100.0, 200, '50']

In [28]:
tmp = Table().with_columns('height', [100., 200, "50"])
tmp

height
100.0
200
50

In [32]:
type(tmp.column('height').item(0))

str

In [33]:
tmp = Table().with_columns('height', [100., 200, 50., 20])
tmp

height
100
200
50
20

In [34]:
type(tmp.column('height').item(0))

float

#### 4. For each city, whats the combined hiehgt of all the buildings?

In [ ]:
# skip

In [35]:
sky.group('city')

city       | count
Atlanta    | 38
Austin     | 17
Baltimore  | 14
Boston     | 32
Charlotte  | 12
Chicago    | 358
Cincinnati | 13
Cleveland  | 16
Columbus   | 13
Dallas     | 20
... (25 rows omitted)

In [36]:
sky.group('city',max)

city       | name max                                | material max | height max | age max
Atlanta    | Westin Peachtree Plaza                  | steel        | 311.8      | 128
Austin     | Windsor on the Lake                     | steel        | 208.15     | 88
Baltimore  | The John and Frances Angelos Law Center | steel        | 161.24     | 114
Boston     | Two International Place                 | steel        | 240.79     | 110
Charlotte  | TradeMark                               | steel        | 265.48     | 101
Chicago    | theWit Hotel                            | steel        | 442.14     | 137
Cincinnati | Scripps Center                          | steel        | 202.69     | 112
Cleveland  | Tower at Erieview                       | steel        | 288.65     | 101
Columbus   | William Green Building                  | steel        | 169.3      | 98
Dallas     | W Dallas Victory Hotel & Residences     | steel        | 280.72     | 97
... (25 rows omitted)

In [38]:
sky.group('city',sum).select('city', 'height sum')

city       | height sum
Atlanta    | 5720.79
Austin     | 2137.03
Baltimore  | 1567.78
Boston     | 4394.79
Charlotte  | 1902.82
Chicago    | 47257
Cincinnati | 1563.67
Cleveland  | 2238.02
Columbus   | 1399.42
Dallas     | 3363.54
... (25 rows omitted)

### For each city, find the average age of all skyscrapers

In [39]:
sky.group('city',sum)

city       | name sum | material sum | height sum | age sum
Atlanta    |          |              | 5720.79    | 1205
Austin     |          |              | 2137.03    | 384
Baltimore  |          |              | 1567.78    | 666
Boston     |          |              | 4394.79    | 1442
Charlotte  |          |              | 1902.82    | 363
Chicago    |          |              | 47257      | 16290
Cincinnati |          |              | 1563.67    | 743
Cleveland  |          |              | 2238.02    | 877
Columbus   |          |              | 1399.42    | 613
Dallas     |          |              | 3363.54    | 891
... (25 rows omitted)

In [40]:
sky.group('city')

city       | count
Atlanta    | 38
Austin     | 17
Baltimore  | 14
Boston     | 32
Charlotte  | 12
Chicago    | 358
Cincinnati | 13
Cleveland  | 16
Columbus   | 13
Dallas     | 20
... (25 rows omitted)

In [43]:
avg_age_array = sky.group('city',sum).column('age sum') / sky.group('city').column('count')

In [44]:
sky.with_columns('avg age', avg_age_array)

ValueError: Column length mismatch. New column does not have the same number of rows as table.

In [45]:
sky.group('city', sum)

city       | name sum | material sum | height sum | age sum
Atlanta    |          |              | 5720.79    | 1205
Austin     |          |              | 2137.03    | 384
Baltimore  |          |              | 1567.78    | 666
Boston     |          |              | 4394.79    | 1442
Charlotte  |          |              | 1902.82    | 363
Chicago    |          |              | 47257      | 16290
Cincinnati |          |              | 1563.67    | 743
Cleveland  |          |              | 2238.02    | 877
Columbus   |          |              | 1399.42    | 613
Dallas     |          |              | 3363.54    | 891
... (25 rows omitted)

In [46]:
sky.group('city', np.mean)

city       | name mean | material mean | height mean | age mean
Atlanta    |           |               | 150.547     | 31.7105
Austin     |           |               | 125.708     | 22.5882
Baltimore  |           |               | 111.984     | 47.5714
Boston     |           |               | 137.337     | 45.0625
Charlotte  |           |               | 158.568     | 30.25
Chicago    |           |               | 132.003     | 45.5028
Cincinnati |           |               | 120.282     | 57.1538
Cleveland  |           |               | 139.876     | 54.8125
Columbus   |           |               | 107.648     | 47.1538
Dallas     |           |               | 168.177     | 44.55
... (25 rows omitted)

#### 5. For each city, how many buidlings are there for the different materials?

In [47]:
sky.group('city')

city       | count
Atlanta    | 38
Austin     | 17
Baltimore  | 14
Boston     | 32
Charlotte  | 12
Chicago    | 358
Cincinnati | 13
Cleveland  | 16
Columbus   | 13
Dallas     | 20
... (25 rows omitted)

In [48]:
sky.group(['city', 'material'])

city      | material        | count
Atlanta   | concrete        | 27
Atlanta   | mixed/composite | 4
Atlanta   | steel           | 7
Austin    | concrete        | 16
Austin    | steel           | 1
Baltimore | concrete        | 8
Baltimore | steel           | 6
Boston    | concrete        | 4
Boston    | mixed/composite | 2
Boston    | steel           | 26
... (81 rows omitted)

#### 6. For each city, whats the combined hiehgt of all the buildings for the different materials?

In [49]:
sky.group(['city', 'material'], sum)

city      | material        | name sum | height sum | age sum
Atlanta   | concrete        |          | 4016.93    | 620
Atlanta   | mixed/composite |          | 916.96     | 120
Atlanta   | steel           |          | 786.9      | 465
Austin    | concrete        |          | 2043.43    | 296
Austin    | steel           |          | 93.6       | 88
Baltimore | concrete        |          | 902.66     | 267
Baltimore | steel           |          | 665.12     | 399
Boston    | concrete        |          | 423.06     | 171
Boston    | mixed/composite |          | 243.2      | 47
Boston    | steel           |          | 3728.53    | 1224
... (81 rows omitted)

In [ ]:
# skip answer below

In [50]:
sky.group(['city', 'material'], np.mean)

city      | material        | name mean | height mean | age mean
Atlanta   | concrete        |           | 148.775     | 22.963
Atlanta   | mixed/composite |           | 229.24      | 30
Atlanta   | steel           |           | 112.414     | 66.4286
Austin    | concrete        |           | 127.714     | 18.5
Austin    | steel           |           | 93.6        | 88
Baltimore | concrete        |           | 112.833     | 33.375
Baltimore | steel           |           | 110.853     | 66.5
Boston    | concrete        |           | 105.765     | 42.75
Boston    | mixed/composite |           | 121.6       | 23.5
Boston    | steel           |           | 143.405     | 47.0769
... (81 rows omitted)

In [51]:
sky.drop('age').group(['city', 'material'], max)

city      | material        | name max                                | height max
Atlanta   | concrete        | Westin Peachtree Plaza                  | 264.25
Atlanta   | mixed/composite | Two Alliance Center                     | 311.8
Atlanta   | steel           | State of Georgia Building               | 169.47
Austin    | concrete        | Windsor on the Lake                     | 208.15
Austin    | steel           | University of Texas Tower               | 93.6
Baltimore | concrete        | The John and Frances Angelos Law Center | 161.24
Baltimore | steel           | Mercy Medical Center Inpatient Tower    | 155.15
Boston    | concrete        | Harbor Towers II                        | 121.92
Boston    | mixed/composite | Ellison Building                        | 139
Boston    | steel           | Two International Place                 | 240.79
... (81 rows omitted)

In [52]:
sky.drop('age').group(['city', 'material'], sum)

city      | material        | name sum | height sum
Atlanta   | concrete        |          | 4016.93
Atlanta   | mixed/composite |          | 916.96
Atlanta   | steel           |          | 786.9
Austin    | concrete        |          | 2043.43
Austin    | steel           |          | 93.6
Baltimore | concrete        |          | 902.66
Baltimore | steel           |          | 665.12
Boston    | concrete        |          | 423.06
Boston    | mixed/composite |          | 243.2
Boston    | steel           |          | 3728.53
... (81 rows omitted)

(back to slides)
# Pivot

In [53]:
sky = Table.read_table('skyscrapers_v2.csv')
sky = (sky.with_column('age', 2020 - sky.column('completed'))
          .drop('completed'))
sky.drop('height', 'age').where('city', are.not_equal_to('New York City')).where('city', are.not_equal_to('Las Vegas')).show(10)

#### 1. In every city, how many towers are there of each material?

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
# skip

In [57]:
sky.group(['city', 'material'])

city      | material        | count
Atlanta   | concrete        | 27
Atlanta   | mixed/composite | 4
Atlanta   | steel           | 7
Austin    | concrete        | 16
Austin    | steel           | 1
Baltimore | concrete        | 8
Baltimore | steel           | 6
Boston    | concrete        | 4
Boston    | mixed/composite | 2
Boston    | steel           | 26
... (81 rows omitted)

In [54]:
sky.pivot('material', 'city')

city       | concrete | mixed/composite | steel
Atlanta    | 27       | 4               | 7
Austin     | 16       | 0               | 1
Baltimore  | 8        | 0               | 6
Boston     | 4        | 2               | 26
Charlotte  | 5        | 3               | 4
Chicago    | 244      | 35              | 79
Cincinnati | 5        | 1               | 7
Cleveland  | 2        | 3               | 11
Columbus   | 4        | 0               | 9
Dallas     | 7        | 2               | 11
... (25 rows omitted)

#### What just happened?
(back to slides)

In [58]:
sky.pivot('material', 'city').show(5)

In [59]:
sky.pivot('material', 'city').num_rows

35

In [ ]:
#sky.pivot('city', 'material').show(5)

What happens if you run `group()` with these two columns?

*Remember when grouping on multiple columns, we need to pass in a list of column names*

In [61]:
sky.group(['material', 'city'])

material | city       | count
concrete | Atlanta    | 27
concrete | Austin     | 16
concrete | Baltimore  | 8
concrete | Boston     | 4
concrete | Charlotte  | 5
concrete | Chicago    | 244
concrete | Cincinnati | 5
concrete | Cleveland  | 2
concrete | Columbus   | 4
concrete | Dallas     | 7
... (81 rows omitted)

In [62]:
sky.pivot('material', 'city').show(5)

In [ ]:
sky.group(['material', 'city']).show(5)

In [ ]:
sky.group(['city', 'material']).show(5)

Let's find the skyscrapers only with steel?

In [63]:
sky.group(['material', 'city']).where('material', are.equal_to('steel')).drop('material')

city       | count
Atlanta    | 7
Austin     | 1
Baltimore  | 6
Boston     | 26
Charlotte  | 4
Chicago    | 79
Cincinnati | 7
Cleveland  | 11
Columbus   | 9
Dallas     | 11
... (23 rows omitted)

### Let's find the average height of towers in each city by each material

`tbl.pivot(col1, col2, values, collect)`

In [67]:
sky.pivot('material', 'city', values='height', collect=np.mean)

city       | concrete | mixed/composite | steel
Atlanta    | 148.775  | 229.24          | 112.414
Austin     | 127.714  | 0               | 93.6
Baltimore  | 112.833  | 0               | 110.853
Boston     | 105.765  | 121.6           | 143.405
Charlotte  | 161.348  | 196.01          | 127.013
Chicago    | 128.285  | 160.217         | 130.985
Cincinnati | 102.808  | 202.69          | 120.991
Cleveland  | 116.755  | 166.363         | 136.856
Columbus   | 77.825   | 0               | 120.902
Dallas     | 125.19   | 260.3           | 178.783
... (25 rows omitted)

In [64]:
sky.pivot('material', 'city')
sky.labels

('name', 'material', 'city', 'height', 'age')

In [65]:
sky.pivot('material', 'city')

city       | concrete | mixed/composite | steel
Atlanta    | 27       | 4               | 7
Austin     | 16       | 0               | 1
Baltimore  | 8        | 0               | 6
Boston     | 4        | 2               | 26
Charlotte  | 5        | 3               | 4
Chicago    | 244      | 35              | 79
Cincinnati | 5        | 1               | 7
Cleveland  | 2        | 3               | 11
Columbus   | 4        | 0               | 9
Dallas     | 7        | 2               | 11
... (25 rows omitted)

In [ ]:
#skip

In [ ]:
# skip

### Let's find the max height of towers in each city by each material

In [68]:
sky.pivot('material', 'city', values='height', collect=max)

city       | concrete | mixed/composite | steel
Atlanta    | 264.25   | 311.8           | 169.47
Austin     | 208.15   | 0               | 93.6
Baltimore  | 161.24   | 0               | 155.15
Boston     | 121.92   | 139             | 240.79
Charlotte  | 265.48   | 239.7           | 179.23
Chicago    | 423.22   | 306.94          | 442.14
Cincinnati | 125      | 202.69          | 175
Cleveland  | 125      | 288.65          | 215.8
Columbus   | 79.25    | 0               | 169.3
Dallas     | 176.48   | 280.72          | 270.06
... (25 rows omitted)

In [ ]:
#skip

In [ ]:
#skip

In [ ]:
#skip

In [ ]:
sky.pivot('material', 'city', 'height', max)

### How to find the range of heights in each city for each type of material?

In [69]:
def max_min_difference(column):
    """
    Find the difference between the maximum value and minimum value of a column
    """
    return max(column) - min(column)

In [70]:
max_min_difference(np.arange(1,100))

98

In [71]:
max_min_difference(make_array(213,12,5,8,14,9,15,21,37,39,63,2,71))

211

In [ ]:
np.arange(1,100)
max(np.arange(1, 100)) - min(np.arange(1,100)), max_min_difference(np.arange(1,100))

In [72]:
type(max_min_difference)

function

In [75]:
sky.pivot('material', 'city', 'height', max_min_difference)

city       | concrete | mixed/composite | steel
Atlanta    | 184.25   | 191.28          | 121.27
Austin     | 127.99   | 0               | 0
Baltimore  | 90.74    | 0               | 71.15
Boston     | 53.34    | 34.8            | 166.39
Charlotte  | 166.42   | 92.18           | 98.23
Chicago    | 378.72   | 255.84          | 388.79
Cincinnati | 38.5     | 0               | 120.7
Cleveland  | 16.49    | 197.21          | 127.71
Columbus   | 3.45     | 0               | 125.41
Dallas     | 122.84   | 40.84           | 156.67
... (25 rows omitted)

The table above represents a pivot table of the range of values

In [74]:
atlanta_heights = sky.where('city', 'Atlanta').where('material', 'concrete').column('height')
max(atlanta_heights) - min(atlanta_heights)

184.25

In [ ]:
sky.group(['city', 'material']).where('city', 'Austin')

In [ ]:
sky.pivot('city', 'material')

(back to slides)
# Join

In [80]:
billionaires = Table.read_table('https://raw.githubusercontent.com/BC-COMS-1016/materials-sp22/refs/heads/master/demos/billionaires.csv')
billionaires.show(10)

countries = Table.read_table('https://raw.githubusercontent.com/BC-COMS-1016/materials-sp22/refs/heads/master/demos/countries.csv')
countries.show(10)

### What can we join these two tables on?
In other words, which columns will have similar values?

In [ ]:
# answer below

In [81]:
#tblA.join(colA, tblB, colB)
billionaires.join('citizenship', countries, 'Country')

citizenship | name                | net worth   | industry        | Continent
Australia   | Gina Rinehart       | 19984845036 | Commodities     | Oceania
Australia   | Andrew Forrest      | 10221458789 | Commodities     | Oceania
Australia   | Harry Triguboff     | 9467000000  | Real Estate     | Oceania
Australia   | Scott Farquhar      | 9335988154  | Technology      | Oceania
Australia   | Mike Cannon-Brookes | 9335988154  | Technology      | Oceania
Australia   | Frank Lowy          | 6655432824  | Real Estate     | Oceania
Australia   | Anthony Pratt       | 6566000000  | Industrial      | Oceania
Austria     | Dietrich Mateschitz | 12251315379 | Food & Beverage | Europe
Austria     | Johann Graf         | 6509183360  | Entertainment   | Europe
Brazil      | Jorge Paulo Lemann  | 23056345424 | Food & Beverage | South America
... (490 rows omitted)

In [82]:
billionaires.num_rows, countries.num_rows, billionaires.join('citizenship', countries, 'Country').num_rows

(500, 198, 500)

In [83]:
countries.join('Country', billionaires, 'citizenship')

Country   | Continent     | name                | net worth   | industry
Australia | Oceania       | Gina Rinehart       | 19984845036 | Commodities
Australia | Oceania       | Andrew Forrest      | 10221458789 | Commodities
Australia | Oceania       | Harry Triguboff     | 9467000000  | Real Estate
Australia | Oceania       | Scott Farquhar      | 9335988154  | Technology
Australia | Oceania       | Mike Cannon-Brookes | 9335988154  | Technology
Australia | Oceania       | Frank Lowy          | 6655432824  | Real Estate
Australia | Oceania       | Anthony Pratt       | 6566000000  | Industrial
Austria   | Europe        | Dietrich Mateschitz | 12251315379 | Food & Beverage
Austria   | Europe        | Johann Graf         | 6509183360  | Entertainment
Brazil    | South America | Jorge Paulo Lemann  | 23056345424 | Food & Beverage
... (490 rows omitted)

##### How many billionaries are in a specific industry and Continent?

In [ ]:
# answer below

In [84]:
billionaires.join('citizenship', countries, 'Country')

citizenship | name                | net worth   | industry        | Continent
Australia   | Gina Rinehart       | 19984845036 | Commodities     | Oceania
Australia   | Andrew Forrest      | 10221458789 | Commodities     | Oceania
Australia   | Harry Triguboff     | 9467000000  | Real Estate     | Oceania
Australia   | Scott Farquhar      | 9335988154  | Technology      | Oceania
Australia   | Mike Cannon-Brookes | 9335988154  | Technology      | Oceania
Australia   | Frank Lowy          | 6655432824  | Real Estate     | Oceania
Australia   | Anthony Pratt       | 6566000000  | Industrial      | Oceania
Austria     | Dietrich Mateschitz | 12251315379 | Food & Beverage | Europe
Austria     | Johann Graf         | 6509183360  | Entertainment   | Europe
Brazil      | Jorge Paulo Lemann  | 23056345424 | Food & Beverage | South America
... (490 rows omitted)

In [85]:
billionaires.join('citizenship', countries, 'Country').pivot('industry', 'Continent')

Continent     | Commodities | Consumer | Diversified | Energy | Entertainment | Finance | Food & Beverage | Health Care | Industrial | Media & Telecom | Real Estate | Retail | Services | Technology
Africa        | 0           | 0        | 2           | 0      | 0             | 0       | 1               | 0           | 2          | 2               | 0           | 0      | 0        | 0
Asia          | 7           | 10       | 27          | 12     | 4             | 4       | 11              | 11          | 21         | 3               | 23          | 8      | 6        | 21
Europe        | 1           | 17       | 13          | 1      | 4             | 1       | 9               | 10          | 21         | 4               | 5           | 15     | 4        | 6
North America | 6           | 14       | 10          | 17     | 9             | 29      | 14              | 6           | 4          | 19              | 12          | 17     | 2        | 33
Oceania       | 2           | 0        | 0           | 0      | 0             | 1       | 0               | 0           | 1          | 0               | 2           | 0      | 0        | 2
South America | 2           | 0        | 0           | 0      | 0             | 6       | 4               | 0           | 1          | 0               | 0           | 0      | 0        | 1

In [86]:
b_and_c = billionaires.join('citizenship', countries, 'Country')
b_and_c

citizenship | name                | net worth   | industry        | Continent
Australia   | Gina Rinehart       | 19984845036 | Commodities     | Oceania
Australia   | Andrew Forrest      | 10221458789 | Commodities     | Oceania
Australia   | Harry Triguboff     | 9467000000  | Real Estate     | Oceania
Australia   | Scott Farquhar      | 9335988154  | Technology      | Oceania
Australia   | Mike Cannon-Brookes | 9335988154  | Technology      | Oceania
Australia   | Frank Lowy          | 6655432824  | Real Estate     | Oceania
Australia   | Anthony Pratt       | 6566000000  | Industrial      | Oceania
Austria     | Dietrich Mateschitz | 12251315379 | Food & Beverage | Europe
Austria     | Johann Graf         | 6509183360  | Entertainment   | Europe
Brazil      | Jorge Paulo Lemann  | 23056345424 | Food & Beverage | South America
... (490 rows omitted)

In [ ]:
b_and_c.pivot('Continent', 'industry')

In [87]:
b_and_c.group(['Continent', 'industry'])

Continent | industry        | count
Africa    | Diversified     | 2
Africa    | Food & Beverage | 1
Africa    | Industrial      | 2
Africa    | Media & Telecom | 2
Asia      | Commodities     | 7
Asia      | Consumer        | 10
Asia      | Diversified     | 27
Asia      | Energy          | 12
Asia      | Entertainment   | 4
Asia      | Finance         | 4
... (46 rows omitted)

##### What is the average net worth of the billionaries in each specific industry and Continent?

In [ ]:
b_and_c.labels

In [88]:
# tbl.pivot(col1, col2, values, collect)
b_and_c.pivot('Continent', 'industry', 'net worth', np.average)

industry        | Africa      | Asia        | Europe      | North America | Oceania     | South America
Commodities     | 0           | 1.03705e+10 | 9.09765e+09 | 6.89452e+09   | 1.51032e+10 | 1.00079e+10
Consumer        | 0           | 8.03002e+09 | 2.10536e+10 | 9.61956e+09   | 0           | 0
Diversified     | 7.29722e+09 | 1.01818e+10 | 8.05679e+09 | 2.51075e+10   | 0           | 0
Energy          | 0           | 1.50254e+10 | 7.09577e+09 | 6.72667e+09   | 0           | 0
Entertainment   | 0           | 7.96645e+09 | 5.39832e+09 | 1.05302e+10   | 0           | 0
Finance         | 0           | 8.79806e+09 | 8.31946e+09 | 8.92508e+09   | 7.07147e+09 | 9.0227e+09
Food & Beverage | 6.15496e+09 | 9.40541e+09 | 1.04686e+10 | 1.27264e+10   | 0           | 1.41998e+10
Health Care     | 0           | 8.79122e+09 | 5.72663e+09 | 1.00891e+10   | 0           | 0
Industrial      | 1.16792e+10 | 9.31591e+09 | 1.01403e+10 | 3.71755e+10   | 6.566e+09   | 5.36317e+09
Media & Telecom | 4.91348e+09 | 7.12921e+09 | 7.5358e+09  | 8.63351e+09   | 0           | 0
... (4 rows omitted)

##### What is the range of net worths of the billionaries in each specific industry and Continent?

In [ ]:
def range(x):
    return ...

# Comparison

In [ ]:
x = 2
y = 3
x, y

In [ ]:
x > 1

In [ ]:
2 > 1

In [ ]:
x > y

In [ ]:
y >= 3

In [ ]:
x == y

In [ ]:
x != 2

In [ ]:
2 != 2

In [ ]:
2 < x < 5

In [ ]:
-1 * x < -1 * y

### Comparing strings

What do we think `"dog" > "cat"` will return?

In [ ]:
"dog" > "cat"

In [ ]:
"zack" > "adam"

In [ ]:
"cat" < "dog"

Why is this the case?

What about strings that start the same?

In [ ]:
"dogma" > "dog"

### Comparisions to arrays

In [ ]:
range_between_one_twenty = np.arange(1, 20)
range_between_one_twenty

In [ ]:
range_between_one_twenty * 2

In [ ]:
range_between_one_twenty > 2

back to slides

### Combining comparisons

In [ ]:
a = True
b = False
a, b

In [ ]:
a or b

In [ ]:
not a, not b

In [ ]:

#True and (not False)
#True and True
a and not b

In [ ]:
x, y

In [ ]:
x > 2 or y > 2

In [ ]:
x > 2 and y > 2

In [ ]:
not (x > 2 or y > 2)

back to slides
### Aggregating Comparisons

In [ ]:
range_between_one_twenty

In [ ]:
6 % 2 == 0

Lets find the number of values that are even

In [ ]:
# Lets first make a function that tells us if a number is even
def is_even(x):
    """ Converts numbers into bool based on whether the number is even or odd
    """
    return x % 2 == 0

Let's test if this function works:

In [ ]:
is_even(2), is_even(5), is_even(-4)

Now let's apply this function to our array (either make a new table and use `apply` or pass it to our function)

In [ ]:
t = Table().with_columns('number', range_between_one_twenty)
t = t.with_columns('is_even', t.apply(is_even, 'number'))
t

Now how many of these numbers are even?

In [ ]:
sum(t.column('is_even'))

back to slides

# Control Statements

In [ ]:
def sign(x):
    '''
    Returns "positive", "negative", "zero" depending on the value of x
    Adam: only use if's
    '''
    return_string = ""
    ...
    return return_string

In [ ]:
sign(10), sign(-10), sign(0)

### `if`, `elif`, and `else`

In [ ]:
def sign(x):
    '''
    Returns "positive", "negative", "zero" depending on the value of x
    '''

### `abs()`
Now try implementing the `abs()` function

In [ ]:
help(abs)

In [ ]:
def abs(x):
    ...

# Random Selection

In [ ]:
groups = make_array('treatment', 'control')
groups

Let's randomly assign 1 individual to each group

Let's randomly assign 5 individuals to each group

Let's repeat this

Do we see any differences?

So now let's store the outcome

back to slides
# `np.append()`
Manually grow an empty array to [0,...,8] one element at a time

back to slides
# `For` Statements

In [ ]:
for i in np.arange(4):
    print('iteration', i)

Use a for loop to grow the array `t`